<a href="https://colab.research.google.com/github/thavha/Regression-predict-group-5/blob/master/regression.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**Data Preprocessing**
Importing Liabraries

In [0]:
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd
import seaborn as sns

/usr/local/lib/python3.6/dist-packages/statsmodels/tools/_testing.py:19: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  import pandas.util.testing as tm

**Importing the data set** and checking the data

In [0]:
dataset = pd.read_csv('Train.csv')
###x =dataset.iloc[:,:-1].values
###y = dataset.iloc[:,-1].values

In [0]:
dataset.head()

         Order No       User Id  ...      Rider Id  Time from Pickup to Arrival
0   Order_No_4211   User_Id_633  ...  Rider_Id_432                          745
1  Order_No_25375  User_Id_2285  ...  Rider_Id_856                         1993
2   Order_No_1899   User_Id_265  ...  Rider_Id_155                          455
3   Order_No_9336  User_Id_1402  ...  Rider_Id_855                         1341
4  Order_No_27883  User_Id_1737  ...  Rider_Id_770                         1214

[5 rows x 29 columns]

selecting only the rlevent  columns that will be used for the model

In [0]:
new_df = dataset[['User Id','Platform Type','Personal or Business','Placement - Day of Month','Placement - Weekday (Mo = 1)','Placement - Time','Confirmation - Time','Arrival at Pickup - Time','Arrival at Destination - Time','Distance (KM)','Temperature','Precipitation in millimeters','Rider Id','Time from Pickup to Arrival']].copy()

In [0]:
new_df.head()

        User Id  Platform Type  ...      Rider Id  Time from Pickup to Arrival
0   User_Id_633              3  ...  Rider_Id_432                          745
1  User_Id_2285              3  ...  Rider_Id_856                         1993
2   User_Id_265              3  ...  Rider_Id_155                          455
3  User_Id_1402              3  ...  Rider_Id_855                         1341
4  User_Id_1737              1  ...  Rider_Id_770                         1214

[5 rows x 14 columns]

dealing with the missing values

In [0]:
new_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21201 entries, 0 to 21200
Data columns (total 14 columns):
 #   Column                         Non-Null Count  Dtype
---  ------                         --------------  -----
 0   User Id                        21201 non-null  object
 1   Platform Type                  21201 non-null  int64
 2   Personal or Business           21201 non-null  object
 3   Placement - Day of Month       21201 non-null  int64
 4   Placement - Weekday (Mo = 1)   21201 non-null  int64
 5   Placement - Time               21201 non-null  object
 6   Confirmation - Time            21201 non-null  object
 7   Arrival at Pickup - Time       21201 non-null  object
 8   Arrival at Destination - Time  21201 non-null  object
 9   Distance (KM)                  21201 non-null  int64
 10  Temperature                    16835 non-null  float64
 11  Precipitation in millimeters   552 non-null    float64
 12  Rider Id                       21201 non-null  object
 13  Time from Pickup to Arrival    21201 non-null  int64
dtypes: float64(2), int64(5), object(7)
memory usage: 2.3+ MB